app/controllers/faqs_controller.rb

  def index
    @faqs = Faq.all
---
SELECT "faqs".* FROM "faqs"