app/controllers/property_forms_controller.rb

  def create
    @property_form = PropertyForm.create(token: set_property_form_token)
    @property_form .update(property_form_params)
---
INSERT INTO "property_forms" ("created_at", "updated_at", "token") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2018-03-19 16:01:47.974200"], ["updated_at", "2018-03-19 16:01:47.974200"], ["token", "IA6HGT8HHH"]]
UPDATE "property_forms" SET "address" = $1, "updated_at" = $2, "latitude" = $3, "longitude" = $4 WHERE "property_forms"."id" = $5  [["address", "12 Rue de Rivoli, Paris, France"], ["updated_at", "2018-03-19 16:06:29.668402"], ["latitude", 48.8556174], ["longitude", 2.3600226], ["id", 15]]

  def update
    if @property_form.update(property_form_params)
---
UPDATE "property_forms" SET "has_works_in_building_planned" = $1, "updated_at" = $2 WHERE "property_forms"."id" = $3  [["has_works_in_building_planned", "f"], ["updated_at", "2018-03-21 11:15:00.268183"], ["id", 17]]

  def c_description_1
    if params[:property_type]
      unless @property_form.update(property_type: params[:property_type])
---
UPDATE "property_forms" SET "property_type" = $1, "updated_at" = $2 WHERE "property_forms"."id" = $3  [["property_type", "appartment"], ["updated_at", "2018-03-19 16:06:50.029760"], ["id", 16]]

  def h_confirmation
    if User.find_by(email: @property_form.email)
      user = User.find_by(email: @property_form.email)
    else
      user = User.create_instance_from_property_form(@property_form)
      unless user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jean.dupont@gmail.com"], ["LIMIT", 1]]
UPDATE "property_forms" SET "user_id" = $1, "updated_at" = $2 WHERE "property_forms"."id" = $3  [["user_id", 1], ["updated_at", "2018-03-21 11:15:25.840227"], ["id", 17]]

  def i_validation
    if @property_form.update(complete: true)
      property_attributes = {}
      @property_form.attributes.keys.each do |k|
        property_attributes[k] = @property_form.attributes[k] || false
      end
      property = RealEstateProperty.new(property_attributes.except('complete'))
      property.property_form = @property_form
      unless property.save
        flash[:alert] = "Un erreur est survenue - le formulaire n'a pas pu être créé"
        redirect_to root_path
      else
        @property_form.property_images.each do |i|
---
UPDATE "property_forms" SET "complete" = $1, "updated_at" = $2 WHERE "property_forms"."id" = $3  [["complete", "t"], ["updated_at", "2018-03-21 11:19:02.608145"], ["id", 17]]
INSERT INTO "real_estate_properties" ("id", "address", "property_type", "num_floors", "num_rooms", "num_bedrooms", "num_bathrooms", "property_total_size_sqm", "size_balcony_sqm", "size_terrace_sqm", "size_cellar_sqm", "building_construction_year", "has_balcony", "has_garage", "has_terrace", "has_cellar", "has_parking", "has_elevator", "has_works_in_building_planned", "building_state", "property_state", "kitchen_state", "bathroom_state", "created_at", "updated_at", "user_id", "property_form_id", "latitude", "longitude", "has_pool", "has_attic", "is_attic_convertible", "appartment_floor", "livable_size_sqm", "ground_floor_size_sqm", "time_to_sell", "first_name", "last_name", "email", "phone_number", "token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41) RETURNING "id"
SELECT "property_images".* FROM "property_images" WHERE "property_images"."property_form_id" = $1  [["property_form_id", 17]]

  def set_property_form
    if params[:token]
      @property_form = PropertyForm.find_by(token: params[:token])
    else
      @property_form = PropertyForm.find_by(id: params[:id])
---
SELECT  "property_forms".* FROM "property_forms" WHERE "property_forms"."token" = $1 LIMIT $2  [["token", "IA6HGT8HHH"], ["LIMIT", 1]]
SELECT  "property_forms".* FROM "property_forms" WHERE "property_forms"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def set_property_form_token
    tokens = PropertyForm.all.map{|p| p.token}
    o = [(1..9), ('A'..'Z')].map(&:to_a).flatten
    token = (0...10).map { o[rand(o.length)] }.join
    while tokens.include?(token)
---
SELECT "property_forms".* FROM "property_forms"
SELECT  1 AS one FROM "property_forms" WHERE "property_forms"."token" = $1 AND ("property_forms"."id" != $2) LIMIT $3  [["token", "IA6HGT8HHH"], ["id", 14], ["LIMIT", 1]]