app/controllers/requests_controller.rb

INSERT INTO "requests" ("email", "first_name", "last_name", "phone_number", "landing", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["email", ""], ["first_name", ""], ["last_name", ""], ["phone_number", ""], ["landing", "some value"], ["created_at", "2018-03-26 14:06:44.224371"], ["updated_at", "2018-03-26 14:06:44.224371"]]
---
  def create
    r = Request.new(property_form_params)
    if r.save